# ExportPatternInfo Properties

---
The ExportPatternInfo type exposes the following members.
| Name| Description
---|---|---
| DestinationPatternName|  The destination pattern name (the name of the pattern in the exported format).
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ExportPatternInfo Class
Autodesk.Revit.DB Namespace